# ATFTranslationService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ATFTranslationService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ATFTranslationService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ATFTranslationService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ATFTranslationService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace